fonecmid-diplom/src/Documents/ВКМ_ВыплатаЗарплаты/ВКМ_ВыплатаЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ВыплатаЗарплаты</name>
  <registerRecords>AccumulationRegister.ВКМ_ВзаиморасчетыССотрудниками</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Выплаты</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВзаиморасчетыССотрудниками/ВКМ_ВзаиморасчетыССотрудниками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВзаиморасчетыССотрудниками</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/Documents/ВКМ_ВыплатаЗарплаты/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ, РежимПроведения) 
	
	 // 1. Подготовка и блокировка данных
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ВКМ_ВзаиморасчетыССотрудниками");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = Выплаты;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Сотрудник", "Сотрудник");
	Блокировка.Заблокировать();

	// 2. Получение данных и остатков
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ

		|	Выплаты.Сотрудник КАК Сотрудник,
		|	СУММА(Выплаты.Сумма) КАК СуммаДокумента
		|ПОМЕСТИТЬ ВТ_Док

		|ИЗ
		|	Документ.ВКМ_ВыплатаЗарплаты.Выплаты КАК Выплаты
		|ГДЕ

		|	Выплаты.Ссылка = &Ссылка
		|СГРУППИРОВАТЬ ПО
		|	Выплаты.Сотрудник

		|;
		|
		|////////////////////////////////////////////////////////////////////////////////

		|ВЫБРАТЬ
		|	ВТ_Док.Сотрудник КАК Сотрудник,
		|	ВТ_Док.СуммаДокумента КАК СуммаДокумента,

		|	ЕСТЬNULL(ВзаиморасчетыОстатки.СуммаОстаток, 0) КАК СуммаОстаток
		|ИЗ
		|	ВТ_Док КАК ВТ_Док

		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВКМ_ВзаиморасчетыССотрудниками.Остатки(&ДатаОстатков, Сотрудник В
		|			(ВЫБРАТЬ ВТ_Док.Сотрудник ИЗ ВТ_Док)) КАК ВзаиморасчетыОстатки
		|		ПО ВТ_Док.Сотрудник = ВзаиморасчетыОстатки.Сотрудник";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	// МоментВремени() нужен, чтобы видеть остатки ДО проведения текущего документа
	Запрос.УстановитьПараметр("ДатаОстатков", МоментВремени());

	// Выгружаем результат в таблицу, чтобы пройтись по ней дважды
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();

	// 3. ЭТАП ПРОВЕРКИ (Первый проход)
	Для Каждого СтрокаКонтроля Из РезультатЗапроса Цикл
		
		Если СтрокаКонтроля.СуммаОстаток = 0 Тогда
			ОбщегоНазначения.СообщитьПользователю(
				СтрШаблон("У сотрудника %1 начислений нет (долг 0)", СтрокаКонтроля.Сотрудник));
			Отказ = Истина;
			
		ИначеЕсли СтрокаКонтроля.СуммаДокумента > СтрокаКонтроля.СуммаОстаток Тогда
			ОбщегоНазначения.СообщитьПользователю(
				СтрШаблон("По сотруднику %1 превышена сумма выплаты! Начислено: %2, к выплате: %3", 
					СтрокаКонтроля.Сотрудник, СтрокаКонтроля.СуммаОстаток, СтрокаКонтроля.СуммаДокумента));
			Отказ = Истина;
		КонецЕсли;
		
	КонецЦикла;

	// 4. ЭТАП ФОРМИРОВАНИЯ ДВИЖЕНИЙ (Второй проход)
	// Создаем движения только в том случае, если ВСЕ проверки пройдены успешно
	Если Не Отказ Тогда
		
		Для Каждого СтрокаДвижения Из РезультатЗапроса Цикл
			
			Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период      = Дата;
			Движение.Сотрудник   = СтрокаДвижения.Сотрудник;
			Движение.Сумма       = СтрокаДвижения.СуммаДокумента;
			
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
